Repository: yben27/emacslispref
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: fr_fr

source: This function returns @var{x} raised to power @var{y}. If both arguments are integers and @var{y} is positive, the result is an integer; in this case, overflow causes truncation, so watch out.
fr_fr: Cette fonction renvoie @var{x} à la puissance @var{y}. Si tout les deux les arguments sont des nombres entiers et @var{y} est positif, le résultat est nombre entier ; dans ce cas, le débordement cause l'abréviation, alors attention.

source: This function returns a copy of abbrev table @var{table}---a new abbrev table that contains the same abbrev definitions. The only difference between @var{table} and the returned copy is that this function sets the property lists of all copied abbrevs to 0.
fr_fr: Cette fonction renvoie une copie de table d'abréviations @var{table}---une nouvelle table d'abréviations qui contient les mêmes définitions d'abréviations---. La seule différence entre @var{table} et la copie retournée est que la fonction place les listes de propriétés de toutes les abréviations copiées à 0.

source: This function returns a hash code for Lisp object @var{obj}. This is an integer which reflects the contents of @var{obj} and the other Lisp objects it points to.
fr_fr: La fonction retourne un code de hachage pour l'objet Lisp @var{obj}. C'est un entier relatif qui donne une image des contenus de l'objet @var{obj} et des autres objets Lisp vers lesquels il pointe.

source: This function returns a new string consisting of the characters in the arguments passed to it (along with their text properties, if any). The arguments may be strings, lists of numbers, or vectors of numbers; they are not themselves changed. If @code{concat} receives no arguments, it returns an empty string.
fr_fr: Cette fonction retourne une nouvelle chaîne constituée des caractères des arguments qui lui sont passés (ainsi que leurs propriétés textuelles, s'ils en ont). Les arguments peuvent être des chaînes de caractères, des listes de nombres, ou des vecteurs de nombres; ils ne sont pas eux-mêmes modifiés. Si @code{concat} ne reçoit aucun argument, elle retourne une chaîne vide.

source: This function returns a new string containing one character, @var{character}. This function is semi-obsolete because the function @code{string} is more general. @xref{Creating Strings}.
fr_fr: Cette fonction retourne une nouvelle chaîne contenant un caractère, @var{character}. Cette fonction est semi-obsolète puisque la fonction @code{string} est plus générale. @xref{Creating Strings}.

source: This function returns a new string that is made by copying @var{string} and then replacing any format specification in the copy with encodings of the corresponding @var{objects}. The arguments @var{objects} are the computed values to be formatted.
fr_fr: Cette fonction retourne une nouvelle chaîne qui est faite en copiant @var{string} puis en remplaçant toute spécification de format de la copie par les codages des @var{objects} correspondants. Les arguments @var{objects} sont les valeurs calculées qui sont à formater.

source: This function returns a new string which consists of those characters from @var{string} in the range from (and including) the character at the index @var{start} up to (but excluding) the character at the index @var{end}. The first character is at index zero.
fr_fr: Cette fonction retourne une nouvelle chaîne qui se compose des caractères de @var{chaine} dans l'intervalle à partir du caractère (et y compris celui-ci) à l’indice @var{debut} jusqu'au caractère (celui-ci non compris) à l’indice @var{fin}. Le premier caractère est à l’indice zéro.

source: This function returns a new vector consisting of @var{length} elements, each initialized to @var{object}.
fr_fr: Cette fonction retourne un nouveau vecteur contenant un nombre @var{length} d'éléments, chacun étant initialisé comme un @var{object}.

source: This function returns a new vector containing all the elements of the @var{sequences}. The arguments @var{sequences} may be true lists, vectors, strings or bool-vectors. If no @var{sequences} are given, an empty vector is returned.
fr_fr: Cette fonction retourne un nouveau vecteur contenant tous les éléments des arguments @var{sequences}. Ces arguments @var{sequences} peuvent être des listes, des vecteurs, des chaînes de caractères ou des vecteurs-booléens. Si aucune @var{sequence} n'est donnée alors un vecteur vide est retourné.

source: This function returns a pseudo-random integer. Repeated calls return a series of pseudo-random integers.
fr_fr: Cette fonction renvoie un nombre entier pseudo-aléatoire. Les appels répétés renvoient a une série de nombres entiers pseudo-aléatoires.

source: This function returns a string consisting of the printed base-ten representation of @var{number}, which may be an integer or a floating point number. The returned value starts with a minus sign if the argument is negative.
fr_fr: Cette fonction retourne une chaîne constituée de la représentation en base dix de @var{number}, qui peut être un entier ou un nombre à virgule flottante. La valeur retournée commence par le signe moins si l'argument est négatif.

source: This function returns a string describing the version of Emacs that is running. It is useful to include this string in bug reports.
fr_fr: Cette fonction renvoie une chaine décrivant la version d'Emacs qui est en fonction. Il est utile d'inclure cette chaine dans des rapports de bogue.

source: This function returns a string made up of @var{count} repetitions of @var{character}. If @var{count} is negative, an error is signaled.
fr_fr: Cette fonction retourne une chaîne faite de @var{n} répétitions de @var{caractere}. Si @var{n} est négatif, une erreur est soulevée.

source: This function returns the @var{index}th element of @var{array}. The first element is at index zero.
fr_fr: Cette fonction retourne l'élément du tableau se situant à l'indice @var{index}. Le premier élément se trouve à l'indice zéro.

source: This function returns the @var{weak} value that was specified for hash table @var{table}.
fr_fr: Cette fonction retourne la valeur de @var{weak} qui a été spécifiée pour la table de hachage @var{table}.

source: This function returns the ``exclusive or'' of its arguments: the @var{n}th bit is set in the result if, and only if, the @var{n}th bit is set in an odd number of the arguments. If there are no arguments, the result is 0, which is an identity element for this operation. If @code{logxor} is passed just one argument, it returns that argument.
fr_fr: Cette fonction renvoie le « ou exclusif » de ses arguments : le @var{n}ième bit est placé dans le résultat si, et seulement si, le bit @var{n}ième bit est placé dans un nombre impair des arguments. S'il n'y a aucun argument, le résultat est 0, qui est un élément d'identité pour cette opération. Si @code{logxor} est passé juste à un argument, il renvoie cet argument.

source: This function returns the ``inclusive or'' of its arguments: the @var{n}th bit is set in the result if, and only if, the @var{n}th bit is set in at least one of the arguments. If there are no arguments, the result is zero, which is an identity element for this operation. If @code{logior} is passed just one argument, it returns that argument.
fr_fr: Cette fonction renvoie le « ou inclus » de ses arguments : le @var{n}ième bit est placé dans le résultat si, et seulement si, le @var{n}ième bit est placé dans au moins un des arguments. S'il n'y a aucun argument, le résultat est 0, ce qui est un élément d'identité pour cette opération. Si @code{logior} est passé à juste un argument, il renvoie cet argument.

source: This function returns the ``logical and'' of the arguments: the @var{n}th bit is set in the result if, and only if, the @var{n}th bit is set in all the arguments. (``Set'' means that the value of the bit is 1 rather than 0.)
fr_fr: Cette fonction renvoie le « et logique » des arguments : le @var{n}th bit est placé dans le résultat si, et seulement si, le @var{n}th bit est placer dans tous arguments. (« Placer » veut dire que la valeur du bit est 1 plutôt que 0.)

source: This function returns the absolute value of @var{number}.
fr_fr: Cette fonction renvoie la valeur absolue de @var{number}.

source: This function returns the actual number of entries in @var{table}.
fr_fr: Cette fonction retourne le nombre effectif d'entrées contenues dans @var{table}.

source: This function returns the binary exponent of @var{number}. More precisely, the value is the logarithm of @var{number} base 2, rounded down to an integer.
fr_fr: Cette fonction renvoie l'exposant binaire de @var{number}. Plus précisément, la valeur est le logarithme de @var{number} en base 2, arrondie vers le bas à un nombre entier.

source: This function returns the contents of extra slot @var{n} of @var{char-table}. The number of extra slots in a char-table is determined by its subtype.
fr_fr: Cette fonction retourne le contenu de la case supplémentaire numéro @var{n} de @var{char-table}. Le nombre de cases supplémentaires dans une char-table est déterminé par son sous-type.

source: This function returns the current buffer's case table.
fr_fr: Cette fonction retourne le tableau de casse courante du tampon.

source: This function returns the element of @var{sequence} indexed by @var{index}. Legitimate values of @var{index} are integers ranging from 0 up to one less than the length of @var{sequence}. If @var{sequence} is a list, out-of-range values behave as for @code{nth}. @xref{Definition of nth}. Otherwise, out-of-range values trigger an @code{args-out-of-range} error.
fr_fr: La fonction retourne l'élément d'une suite @var{sequence} ordonnée selon les indices @var{index}. Les indices doivent être des entiers allant de 0 jusqu'à la longueur de la suite moins un. Si @var{sequence} est une liste, les valeurs hors-intervalle donneront le même résultat que la n-ième valeur. @xref{Definition of nth}. Dans les autres cas, les valeurs hors-intervalle lanceront une erreur @code{args-out-of-range} (argument-hors-intervalle).

source: This function returns the first character in @var{string}. If the string is empty, the function returns 0. The value is also 0 when the first character of @var{string} is the null character, @acronym{ASCII} code 0.
fr_fr: Cette fonction retourne le premier caractère de @var{string}. Si la chaîne est vide, la fonction retourne 0. La valeur retournée est aussi 0 lorsque le premier caractère de @var{string} est un caractère nul, code @acronym{ASCII} 0.

source: This function returns the integer remainder after division of @var{dividend} by @var{divisor}. The arguments must be integers or markers.
fr_fr: Cette fonction renvoie le reste en nombre entier après la division de @var{dividend} par @var{divisor}. Les arguments doivent être des nombres entiers ou des marqueurs.

source: This function returns the largest of its arguments. If any of the arguments is floating-point, the value is returned as floating point, even if it was given as an integer.
fr_fr: Cette fonction renvoie le plus grand de ses arguments. Si l'un des arguments est à virgule flottante, la valeur est retournée à virgule flottante, même si elle était donnée comme nombre entier.

source: This function returns the logarithm of @var{arg}, with base 10. If @var{arg} is negative, it signals a @code{domain-error} error. @code{(log10 @var{x})} @equiv{} @code{(log @var{x} 10)}, at least approximately.
fr_fr: Cette fonction renvoie le logarithme de @var{arg}, en base 10. Si @var{arg} est négatif, il signale une erreur @code{domain-error}. @code{(log10 @var{x})} @equiv{} @code{(log @var{x} 10)}, au moins approximativement.

source: This function returns the logarithm of @var{arg}, with base @var{base}. If you don't specify @var{base}, the base
fr_fr: Cette fonction renvoie le logarithme de @var{arg}, en base @var{base}. Si vous n'indiquez pas @var{base}, la base

source: This function returns the logical complement of its argument: the @var{n}th bit is one in the result if, and only if, the @var{n}th bit is zero in @var{integer}, and vice-versa.
fr_fr: Cette fonction renvoie le complément logique de son argument : le @var{n}ième bit est 1 dans le résultat si, et seulement si, le @var{n}ième bit est 0 dans @var{integer}, et vice-versa.

source: This function returns the number of elements in @var{sequence}. If @var{sequence} is a dotted list, a @code{wrong-type-argument} error is signaled. Circular lists may cause an infinite loop. For a char-table, the value returned is always one more than the maximum Emacs character code.
fr_fr: Cette fonction retourne le nombre d'éléments dans une suite @var{sequence}. Si une suite @var{sequence} est une liste pointée, une erreur @code{wrong-type-argument} (mauvais-type-d-argument) est signalée. Les listes circulaires peuvent entraîner une boucle infinie. Pour une table de chaînes de caractères, la valeur retournée est toujours supérieure de un au code caractère maximum d'Emacs.

source: This function returns the numeric value of the characters in @var{string}. If @var{base} is non-@code{nil}, it must be an integer between 2 and 16 (inclusive), and integers are converted in that base. If @var{base} is @code{nil}, then base ten is used. Floating point conversion only works in base ten; we have not implemented other radices for floating point numbers, because that would be much more work and does not seem useful. If @var{string} looks like an integer but its value is too large to fit into a Lisp integer, @code{string-to-number} returns a floating point result.
fr_fr: Cette fonction retourne la valeur numérique des caractères de @var{string}. Si @var{base} est non @code{nil}, elle doit être un entier compris entre 2 et 16 (inclus), et les entiers sont convertis dans cette base. Si @var{base} est @code{nil}, alors la base dix est utilisée. La conversion de la virgule flottante ne fonctionne qu'en base dix; nous n'avons pas implanté d'autres bases de numération pour les nombres à virgule, parce que cela donnerait beaucoup plus de travail et que cela ne semble pas utile. Si @var{string} ressemble à un entier mais que sa valeur est trop grande pour tenir dans un entier Lisp, @code{string-to-number} retourne un résultat de type "float".

source: This function returns the parent of @var{char-table}. The parent is always either @code{nil} or another char-table.
fr_fr: Cette fonction retourne le parent de @var{char-table}. Le parent est toujours soit @code{nil}, soit une autre char-table.

source: This function returns the smallest of its arguments. If any of the arguments is floating-point, the value is returned as floating point, even if it was given as an integer.
fr_fr: Cette fonction renvoie le plus petit de ses arguments. Si l'un des arguments est à virgule flottante, la valeur est retournée à virgule flottante, même si elle était donnée comme nombre entier.

source: This function returns the string that is @var{symbol}'s name. For example:
fr_fr: Cette fonction renvoie la chaîne correspondant au nom du symbole. Par exemple :

source: This function returns the subtype symbol of @var{char-table}.
fr_fr: Cette fonction retourne le symbole du sous-type de @var{char-table}.

source: This function returns the value of @var{dividend} modulo @var{divisor}; in other words, the remainder after division of @var{dividend} by @var{divisor}, but with the same sign as @var{divisor}. The arguments must be numbers or markers.
fr_fr: Cette fonction renvoie la valeur de @var{dividend} modulo @var{divisor}; en d'autres termes, le reste après la division de @var{dividend} par @var{divisor}, mais avec le même signe que @var{divisor}. Les arguments doivent être des nombres ou des marqueurs.

source: This function rounds @var{float} to the nearest integral value, and returns that value as a floating point number.
fr_fr: Cette fonction arrondit @var{float} à la valeur intégrale la plus proche, et renvoie cette valeur comme nombre de virgule flottante.

source: This function rounds @var{float} to the next higher integral value, and returns that value as a floating point number.
fr_fr: Cette fonction arrondit @var{float} à la prochaine valeur intégrale supérieure, et renvoie cette valeur comme nombre à virgule flottante.

source: This function rounds @var{float} to the next lower integral value, and returns that value as a floating point number.
fr_fr: Cette fonction arrondit @var{float} à la prochaine valeur intégrale inférieure, et renvoie cette valeur comme nombre à virgule flottante.

source: This function rounds @var{float} towards zero to an integral value, and returns that value as a floating point number.
fr_fr: Cette fonction arrondit @var{float} à la valeur intégrale proche de zéro, et renvoie cette valeur comme nombre à virgule flottante.

source: This function sets the @var{index}th element of @var{array} to be @var{object}. It returns @var{object}.
fr_fr: Cette fonction définit le @var{n}-ième élément du tableau @var{array} comme un @var{object}. Elle retourne @var{object}.

source: This function sets the default value of generic character @var{char} in @var{char-table} to @var{new-default}.
fr_fr: Cette fonction définit @var{new-default} comme la valeur par défaut du caractère générique @var{char} d'une char-table.

source: This function sets the parent of @var{char-table} to @var{new-parent}.
fr_fr: Cette fonction définit @var{new-parent} comme parent de @var{char-table}.

source: This function sets the value in @var{char-table} for a range of characters @var{range}. Here are the possibilities for @var{range}:
fr_fr: Cette fonction définit la valeur dans @var{char-table} pour la gamme de caractères @var{range}. Voici les valeurs possibles de @var{range}:

source: This function specifies a pair of corresponding letters, one upper case and one lower case.
fr_fr: Cette fonction spécifie une paire de lettres correspondantes, une en capitale et l'autre en bas de casse.

source: This function splits @var{string} into substrings at matches for the regular expression @var{separators}. Each match for @var{separators} defines a splitting point; the substrings between the splitting points are made into a list, which is the value returned by @code{split-string}.
fr_fr: Cette fonction sépare @var{string} en sous-chaînes à chaque correspondance avec les expressions régulières @var{separators}. Chaque fois qu'il y a correspondance avec @var{separators}, un point de séparation est défini; les sous-chaînes entre les points de séparation sont mises dans une liste, qui est la valeur retournée par @code{split-string}.

source: This function stores @var{value} in extra slot @var{n} of @var{char-table}.
fr_fr: Cette fonction stocke @var{value} dans la case supplémentaire numéro @var{n} de @var{char-table}.

source: This function tests whether its arguments are numerically equal, and returns @code{t} if so, @code{nil} otherwise.
fr_fr: Cette fonction teste si ses arguments sont numériquement égaux, et renvoie le @code{t} si oui, @code{nil} autrement.

source: This function tests whether its arguments are numerically equal, and returns @code{t} if they are not, and @code{nil} if they are.
fr_fr: Cette fonction teste si ses arguments sont numériquement égaux, et renvoie @code{t} s'ils ne sont pas égaux, et @code{nil} s'ils sont égaux.

source: This function tests whether its first argument is greater than or equal to its second argument. It returns @code{t} if so, @code{nil} otherwise.
fr_fr: Cette fonction teste si son premier argument est supérieur ou égal à son deuxième argument. Il renvoie @code{t} si oui, @code{nil} autrement.

source: This function tests whether its first argument is less than or equal to its second argument. It returns @code{t} if so, @code{nil} otherwise.
fr_fr: Cette fonction teste si son premier argument est inférieur ou égal à son deuxième argument. Elle renvoie @code{t} si oui, @code{nil} autrement.

source: This function tests whether its first argument is strictly greater than its second argument. It returns @code{t} if so, @code{nil} otherwise.
fr_fr: Cette fonction teste si son premier argument est strictement plus grand que son deuxième argument. Elle renvoie @code{t} si oui, @code{nil} autrement.

source: This function tests whether its first argument is strictly less than its second argument. It returns @code{t} if so, @code{nil} otherwise.
fr_fr: Cette fonction teste si son premier argument est strictement moins grand que son deuxième argument. Elle renvoie @code{t} si oui, @code{nil} autrement.

source: This function undefines all the abbrevs in abbrev table @var{table}, leaving it empty. It always returns @code{nil}.
fr_fr: Cette fonction élimine toutes les abréviations dans la table d'abréviations @var{table}, la laissant vide. Elle renvoie toujours @code{nil}.

source: This function works like @code{assoc}, except that @var{key} must be a string or symbol, and comparison is done using @code{compare-strings}. Symbols are converted to strings before testing. If @var{case-fold} is non-@code{nil}, it ignores case differences. Unlike @code{assoc}, this function can also match elements of the alist that are strings or symbols rather than conses. In particular, @var{alist} can be a list of strings or symbols rather than an actual alist. @xref{Association Lists}.
fr_fr: Cette fonction se comporte comme @code{assoc}, sauf que @var{key} doit être une chaîne ou un symbole, et la comparaison se fait en utilisant @code{compare-strings}. Les symboles sont convertis en chaîne avant le test. Si @var{case-fold} est non @code{nil}, il ignore la différence de casse. Contrairement à @code{assoc}, cette fonction peut aussi faire correspondre des éléments de la "alist" qui sont des chaînes ou des symboles plutôt que des cellules cons. En particulier, @var{alist} peut être une liste de chaînes ou de symboles plutôt qu'une "alist" réelle. Voir la section @xref{Association Lists}.

source: This imaginary special form implements a loop that executes the @var{body} forms and then increments the variable @var{var} on each iteration. On the first iteration, the variable has the value @var{from}; on subsequent iterations, it is incremented by one (or by @var{inc} if that is given). The loop exits before executing @var{body} if @var{var} equals @var{to}. Here is an example:
fr_fr: Ce formulaire spécial imaginaire met en application une boucle qui exécute la forme @var{body} et qui ensuite incrémente la variable @var{var} à chaque itération. Sur la première itération, la variable a la valeur @var{from} ; sur des itérations suivantes, elle est incrémentée de un (ou par @var{inc} si elle est donnée). La boucle est arrêtée avant l'exécution de @var{body} si @var{var} est égale à @var{to}. Voici un exemple :

source: This is a list of symbols whose values are abbrev tables. @code{define-abbrev-table} adds the new abbrev table name to this list.
fr_fr: C'est une liste de symboles dont les valeurs sont des tables d'abréviations. @code{define-abbrev-table} ajoute le nouveau nom de table d'abréviations à cette liste.

source: This is edition @value{VERSION} of the GNU Emacs Lisp Reference Manual, corresponding to Emacs version @value{EMACSVER}.
fr_fr: Ceci est l'édition @value{VERSION} du manuel de référence de GNU Emacs Lisp, correspondant à la version d'Emacs @value{EMACSVER}.

source: This is equivalent to @code{make-hash-table}, but with a different style argument list. The argument @var{test} specifies the method of key lookup.
fr_fr: Équivaut à @code{make-hash-table}, mais avec un agencement différent de la liste d'arguments. L'argument @var{test} spécifie la méthode de recherche de clé.

source: This is the exponential function; it returns
fr_fr: C'est la fonction exponentielle ; elle retourne
